----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 4, 128, 128]              40
       BatchNorm2d-2          [-1, 4, 128, 128]               8
              ReLU-3          [-1, 4, 128, 128]               0
         MaxPool2d-4            [-1, 4, 64, 64]               0
          Upsample-5          [-1, 4, 128, 128]               0
            Conv2d-6          [-1, 4, 128, 128]             148
       BatchNorm2d-7          [-1, 4, 128, 128]               8
              ReLU-8          [-1, 4, 128, 128]               0
            Conv2d-9          [-1, 2, 128, 128]              10
================================================================
Total params: 214
Trainable params: 214
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.06
Forward/backward pass size (MB): 3.88
Params size (MB): 0.00
Estimated Total Size (MB): 3.94
----------------------------------------------------------------





----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 4, 128, 128]              40
       BatchNorm2d-2          [-1, 4, 128, 128]               8
              ReLU-3          [-1, 4, 128, 128]               0
         MaxPool2d-4            [-1, 4, 64, 64]               0
   ConvTranspose2d-5          [-1, 4, 128, 128]             260
       BatchNorm2d-6          [-1, 4, 128, 128]               8
              ReLU-7          [-1, 4, 128, 128]               0
            Conv2d-8          [-1, 2, 128, 128]              10
================================================================
Total params: 326
Trainable params: 326
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.06
Forward/backward pass size (MB): 3.38
Params size (MB): 0.00
Estimated Total Size (MB): 3.44
----------------------------------------------------------------







----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 128, 128]             160
       BatchNorm2d-2         [-1, 16, 128, 128]              32
              ReLU-3         [-1, 16, 128, 128]               0
            Conv2d-4         [-1, 16, 128, 128]           2,320
       BatchNorm2d-5         [-1, 16, 128, 128]              32
              ReLU-6         [-1, 16, 128, 128]               0
        conv_block-7         [-1, 16, 128, 128]               0
         MaxPool2d-8           [-1, 16, 64, 64]               0
            Conv2d-9           [-1, 32, 64, 64]           4,640
      BatchNorm2d-10           [-1, 32, 64, 64]              64
             ReLU-11           [-1, 32, 64, 64]               0
           Conv2d-12           [-1, 32, 64, 64]           9,248
      BatchNorm2d-13           [-1, 32, 64, 64]              64
             ReLU-14           [-1, 32, 64, 64]               0
       conv_block-15           [-1, 32, 64, 64]               0
        MaxPool2d-16           [-1, 32, 32, 32]               0
           Conv2d-17           [-1, 64, 32, 32]          18,496
      BatchNorm2d-18           [-1, 64, 32, 32]             128
             ReLU-19           [-1, 64, 32, 32]               0
           Conv2d-20           [-1, 64, 32, 32]          36,928
      BatchNorm2d-21           [-1, 64, 32, 32]             128
             ReLU-22           [-1, 64, 32, 32]               0
       conv_block-23           [-1, 64, 32, 32]               0
        MaxPool2d-24           [-1, 64, 16, 16]               0
           Conv2d-25          [-1, 128, 16, 16]          73,856
      BatchNorm2d-26          [-1, 128, 16, 16]             256
             ReLU-27          [-1, 128, 16, 16]               0
           Conv2d-28          [-1, 128, 16, 16]         147,584
      BatchNorm2d-29          [-1, 128, 16, 16]             256
             ReLU-30          [-1, 128, 16, 16]               0
       conv_block-31          [-1, 128, 16, 16]               0
        MaxPool2d-32            [-1, 128, 8, 8]               0
           Conv2d-33            [-1, 256, 8, 8]         295,168
      BatchNorm2d-34            [-1, 256, 8, 8]             512
             ReLU-35            [-1, 256, 8, 8]               0
           Conv2d-36            [-1, 256, 8, 8]         590,080
      BatchNorm2d-37            [-1, 256, 8, 8]             512
             ReLU-38            [-1, 256, 8, 8]               0
       conv_block-39            [-1, 256, 8, 8]               0
  ConvTranspose2d-40          [-1, 128, 16, 16]         524,416
      BatchNorm2d-41          [-1, 128, 16, 16]             256
             ReLU-42          [-1, 128, 16, 16]               0
       up_Tr_conv-43          [-1, 128, 16, 16]               0
           Conv2d-44          [-1, 128, 16, 16]         295,040
      BatchNorm2d-45          [-1, 128, 16, 16]             256
             ReLU-46          [-1, 128, 16, 16]               0
           Conv2d-47          [-1, 128, 16, 16]         147,584
      BatchNorm2d-48          [-1, 128, 16, 16]             256
             ReLU-49          [-1, 128, 16, 16]               0
       conv_block-50          [-1, 128, 16, 16]               0
  ConvTranspose2d-51           [-1, 64, 32, 32]         131,136
      BatchNorm2d-52           [-1, 64, 32, 32]             128
             ReLU-53           [-1, 64, 32, 32]               0
       up_Tr_conv-54           [-1, 64, 32, 32]               0
           Conv2d-55           [-1, 64, 32, 32]          73,792
      BatchNorm2d-56           [-1, 64, 32, 32]             128
             ReLU-57           [-1, 64, 32, 32]               0
           Conv2d-58           [-1, 64, 32, 32]          36,928
      BatchNorm2d-59           [-1, 64, 32, 32]             128
             ReLU-60           [-1, 64, 32, 32]               0
       conv_block-61           [-1, 64, 32, 32]               0
  ConvTranspose2d-62           [-1, 32, 64, 64]          32,800
      BatchNorm2d-63           [-1, 32, 64, 64]              64
             ReLU-64           [-1, 32, 64, 64]               0
       up_Tr_conv-65           [-1, 32, 64, 64]               0
           Conv2d-66           [-1, 32, 64, 64]          18,464
      BatchNorm2d-67           [-1, 32, 64, 64]              64
             ReLU-68           [-1, 32, 64, 64]               0
           Conv2d-69           [-1, 32, 64, 64]           9,248
      BatchNorm2d-70           [-1, 32, 64, 64]              64
             ReLU-71           [-1, 32, 64, 64]               0
       conv_block-72           [-1, 32, 64, 64]               0
  ConvTranspose2d-73         [-1, 16, 128, 128]           8,208
      BatchNorm2d-74         [-1, 16, 128, 128]              32
             ReLU-75         [-1, 16, 128, 128]               0
       up_Tr_conv-76         [-1, 16, 128, 128]               0
           Conv2d-77         [-1, 16, 128, 128]           4,624
      BatchNorm2d-78         [-1, 16, 128, 128]              32
             ReLU-79         [-1, 16, 128, 128]               0
           Conv2d-80         [-1, 16, 128, 128]           2,320
      BatchNorm2d-81         [-1, 16, 128, 128]              32
             ReLU-82         [-1, 16, 128, 128]               0
       conv_block-83         [-1, 16, 128, 128]               0
           Conv2d-84          [-1, 2, 128, 128]              34
================================================================
Total params: 2,466,498
Trainable params: 2,466,498
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.06
Forward/backward pass size (MB): 69.56
Params size (MB): 9.41
Estimated Total Size (MB): 79.03
----------------------------------------------------------------